<h1>Операция в Php</h1> 
<h2>Арифметические операции</h2>
<p>+ - * / ** %</p>
<?php
$a = 33 % 22;
echo $a; 
?>
<h2>Инкремент и декремент</h2>
<?php
$b = 2;
$с = ++$b;
echo "b = $b, c = $c";
?>
<h2>Операция со строрками</h2>
<?php
$str1 = 'Hello, ';
$str2 = 'PHP!';
$str3 = 'Я учусь на ' . 2 . 'курсе';
echo $str1 . $str2, '<br>' , $str3;
?>
<h2>Операция сравнения</h2
<p>< > <= >= == != === !==</p>
<?php
$s = 4 == 4;
$s1 = 4 === '4';
echo $s;
?>
<h2>Логические операции</h2>
<p> Логтческое И(&& and), логическое ИЛИ(ll
    or и логичкское НЕ (!)) </p>
    <?php
    $p = true &&  false; // false
    $p1 = true ||  false; // true
    $p2 = 5 <= 7 && 4 == 5; //false
    $p3 = !$p2; // true
    ?>

<h2>Операция присваивания </h2>
<p>=  </p>
$o = $r = 5; // o и r = 5
<p>+ -= *= /= **= %= /= </p>
<?php
?>
$1 = 42;
$1 += 10;
$string = 'hello, ';
$string . =  'world!';
echo $string;
?>
<h2>Приоритет операций</h2>
<p>**</p>
<p>++ --</p>
<p>!</p>
<p>* / %</p>
<p> -</p>
<p> <= >=</p>
<p>&&</p>
<p>||</p>
<p>= += -= ...</p>

<p>Ошибка 
    $a  < $b <$c</p>
 