<h1>Практическая работа</h1>
<?php
$a = 5;
$b = 4;
$c = 2;
$d = 4;

$result = (($a / $c) * ($b / $d)) - (($a * $b - $c) / ($c * $d));

 "a = $a";
 "b = $b";
 "c = $c";
 "d = $d";
 "Результат = " . $result;
?>

<h2>Практическая работа 2</h2>
<?php
$x = 4;
$y = 2;

$formula2 = (($x + $y) / ($y + 1)) - (($x * $y - 12) / (34 + $x));

 "x = $x";
 "y = $y";
 "Результат = " . $formula2;
?>

<h3>Практическая 3</h3>
<?php
$x = 4;
$y = 5;

$formula1 = (($x + 1) / ($x - 1), $x) + (18 * $x * ($y, 2));

 "x = $x";
 "y = $y";
 "Результат = " . $formula1;
?>

<h4>Практическая 4</h4>
<?php
$x = 6;
$y = 9;

$formula3 = (1 + (1 / ($x, 2)), $x) - (12 * ($x, 2) * $y);

 "x = $x";
 "y = $y";
 "Результат = " . $formula3;
?>



