Задание 1. Вычисления по заданным формулам (вывод через echo)

// ---------- Формула 1: (a/c) * (b/d) - (ab - c)/(cd) ----------
$a = 5;
$b = 3;
$c = 2;
$d = 4;
$result1 = ($a / $c) * ($b / $d) - ($a * $b - $c) / ($c * $d);

echo "Формула1:\n";
echo "a = " . $a . "\n";
echo "b = " . $b . "\n";
echo "c = " . $c . "\n";
echo "d = " . $d . "\n";
echo "Результат = " . $result1 . "\n";
echo "\n";

// ---------- Формула 2: (x + y)/(y + 1) - (xy - 12)/(34 + x) ----------
$x = 2;
$y = 3;
$result2 = ($x + $y) / ($y + 1) - ($x * $y - 12) / (34 + $x);

echo "Формула2:\n";
echo "x = " . $x . "\n";
echo "y = " . $y . "\n";
echo "Результат = " . $result2 . "\n";
echo "\n";

#Формула 3
$y = 3;
$result3 = pow(($x + 1) / ($x - 1), $x) + 18 * $x * pow($y, 2);

echo "Формула3:\n";
echo "x = " . $x . "\n";
echo "y = " . $y . "\n";
echo "Результат = " . $result3 . "\n";
echo "\n";

#Формула 4
$x = 2;
$y = 3;
$result4 = pow(1 + 1 / pow($x, 2), $x) - 12 * pow($x, 2) * $y;

echo "Формула4:\n";
echo "x = " . $x . "\n";
echo "y = " . $y . "\n";
echo "Результат = " . $result4 . "\n";
?>