<?php
$a = 5;
$b = 4;
$c = 2;
$d = 3;


$result = (($a / $c) * ($b / $d)) - (($a * $b - $c) / ($c * $d));

echo "Результат вычисления: " . $result;
?>
<?php
// начальные значения для переменных x и y
$x = 4;
$y = 2;
// (x + y)/(y + 1) - (xy - 12)/(34 + x)

$formula2 = (($x + $y) / ($y + 1)) - (($x * $y - 12) / (34 + $x));



// ФОРМУЛА 3 
// ((x + 1)/(x - 1))^x + 18 * x * y^2
// ==========================================
// pow($base, $exp) используется для возведения в степень в PHP
$formula2 = pow(($x + 1) / ($x - 1), $x) + (18 * $x * pow($y, 2));


// ==========================================
// ФОРМУЛА 3 (Нижняя со второго изображения)
// (1 + 1/x^2)^x - 12 * x^2 * y
// ==========================================
$formula3 = pow(1 + (1 / pow($x, 2)), $x) - (12 * pow($x, 2) * $y);


// Вывод результатов на экран
echo "Результат формулы 1: " . $formula1 . "<br>";
echo "Результат формулы 2: " . $formula2 . "<br>";
echo "Результат формулы 3: " . $formula3 . "<br>";
?>